#### Q1. List any five functions of the pandas library with execution.

#### Ans-  Here are five functions from the pandas library along with their execution examples:

#### 1. read_csv(): Used to read data from a CSV file into a pandas DataFrame.

In [10]:
import pandas as pd

# Reading a CSV file into a DataFrame
df = pd.read_csv('placement.csv')
print(df)

     cgpa  package
0    6.89     3.26
1    5.12     1.98
2    7.82     3.25
3    7.42     3.67
4    6.94     3.57
..    ...      ...
195  6.93     2.46
196  5.89     2.57
197  7.21     3.24
198  7.63     3.96
199  6.22     2.33

[200 rows x 2 columns]

#### 2. head(): Displays the first few rows of a DataFrame (default: 5 rows).

In [11]:
df.head()

   cgpa  package
0  6.89     3.26
1  5.12     1.98
2  7.82     3.25
3  7.42     3.67
4  6.94     3.57

#### 3. info(): Provides information about a DataFrame, including data types and memory

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cgpa     200 non-null    float64
 1   package  200 non-null    float64
dtypes: float64(2)
memory usage: 3.2 KB

#### 4. column : to know which coloumn is present

In [20]:
df.columns

Index(['cgpa', 'package'], dtype='object')

#### 5. tail(): to know the last five records.

In [21]:
df.tail()

     cgpa  package
195  6.93     2.46
196  5.89     2.57
197  7.21     3.24
198  7.63     3.96
199  6.22     2.33

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [24]:
import pandas as pd

# Example DataFrame
data = {'A': [10, 20, 30, 40],
        'B': [50, 60, 70, 80],
        'C': [90, 100, 110, 120]}

df = pd.DataFrame(data)

# Reindexing the DataFrame
df_reindexed = df.reset_index(drop=True)
df_reindexed.index = df_reindexed.index * 2 + 1

print(df_reindexed)

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [15]:
import pandas as pd

data={"values":[10,20,30,40,50]}

df=pd.DataFrame(data)

sum_of_first_three=df["values"].head(3).sum()
print("sum_of_first_three_number:",sum_of_first_three)

sum_of_first_three_number: 60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
import pandas as pd

# Example DataFrame
data = {'Text': ['This is a sample sentence.',
                 'Pandas is a powerful library for data analysis.',
                 'Python programming is fun and versatile.']}

df = pd.DataFrame(data)

# Add a new 'Word_Count' column
df['Word_Count'] = df['Text'].str.split().apply(len)

print(df)

                                              Text  Word_Count
0                       This is a sample sentence.           5
1  Pandas is a powerful library for data analysis.           8
2         Python programming is fun and versatile.           6

In [19]:
import pandas as pd

data={"Text":['My name is Neha.',
      "I am learning Data Science Course in Pwskills",
      "I am facing a lot of difficulties in understanding Machine learning and deep learning"]}
df=pd.DataFrame(data)

df["word_count"]=df["Text"].str.split().apply(len)

In [20]:
df["word_count"]

0     4
1     8
2    14
Name: word_count, dtype: int64

In [24]:
df

                                                Text  word_count
0                                   My name is Neha.           4
1      I am learning Data Science Course in Pwskills           8
2  I am facing a lot of difficulties in understan...          14

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### Ans- Both DataFrame.size and DataFrame.shape are attributes of a Pandas DataFrame that provide information about the dimensions of the DataFrame, but they provide different types of information:

1. DataFrame.size: This attribute returns the total number of elements in the DataFrame. It gives you the total count of cells in the DataFrame, which is the product of the number of rows and the number of columns.

2. DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame. The tuple contains two values: the number of rows and the number of columns.

Lets see with examples:

In [28]:
df.size

6

In [29]:
df.shape

(3, 2)

#### Q6. Which function of pandas do we use to read an excel file?

#### Ans- To read an Excel file using pandas, you can use the pd.read_excel() function. This function allows you to read data from an Excel file (both .xls and .xlsx formats) and create a pandas DataFrame.

In [30]:
import pandas as pd

df=pd.read_excel("country code.xlsx")
df

     Unnamed: 0              Country       CODE
0           NaN              Albania   UNC - 83
1           NaN              Algeria  UNC - 109
2           NaN               Angola  UNC - 291
3           NaN  Antigua and Barbuda  UNC - 127
4           NaN            Argentina  UNC - 252
..          ...                  ...        ...
187         NaN          Afghanistan   UNC - 68
188         NaN                 Iraq  UNC - 145
189         NaN                Nauru  UNC - 288
190         NaN           San Marino   UNC - 81
191         NaN               Tuvalu  UNC - 218

[192 rows x 3 columns]

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [34]:
import pandas as pd

data={"Email_id":["nehunk1997@gmail.com",
       "nehakumari1998@gmail.com",
       "anjanashakya04@gmail.com",
      "dev32@gmail.com"]}

pd.DataFrame(data)

                   Email_id
0      nehunk1997@gmail.com
1  nehakumari1998@gmail.com
2  anjanashakya04@gmail.com
3           dev32@gmail.com

In [35]:
df=pd.DataFrame(data)

df["Username"]=df["Email_id"].str.split("@")

In [36]:
df["Username"]

0        [nehunk1997, gmail.com]
1    [nehakumari1998, gmail.com]
2    [anjanashakya04, gmail.com]
3             [dev32, gmail.com]
Name: Username, dtype: object

In [37]:

df["Username"]=df["Email_id"].str.split("@").str[0]

In [38]:
df["Username"]

0        nehunk1997
1    nehakumari1998
2    anjanashakya04
3             dev32
Name: Username, dtype: object

In [39]:
df

                   Email_id        Username
0      nehunk1997@gmail.com      nehunk1997
1  nehakumari1998@gmail.com  nehakumari1998
2  anjanashakya04@gmail.com  anjanashakya04
3           dev32@gmail.com           dev32

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [43]:
# For example, if df contains the following values:
#   A B C
# 0 3 5 1
# 1 8 2 7
# 2 6 9 4
# 3 2 3 5
# 4 9 1 2


# Your function should select the following rows: A B C

# 1 8 2 7
# 4 9 1 2
# The function should return a new DataFrame that contains only the selected rows.

In [53]:
import pandas as pd

data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

df = pd.DataFrame(data)

selected_rows=df[(df["A"]>5) & (df["B"]<10)]

selected_rows

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [58]:
import pandas as pd

data={"values":[10,20,30,40,50,60,70,80,5,64,38]}

df=pd.DataFrame(data)

mean_value=df["values"].mean()
median_value=df["values"].median()
standard_deviation=df["values"].std()

print("mean value is ",mean_value)
print("median value is ",median_value)
print("standard deviation is ",standard_deviation)

mean value is  42.45454545454545
median value is  40.0
standard deviation is  24.77645509899928

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [60]:
import pandas as pd

# Example DataFrame
data = {'Date': pd.date_range(start='2023-08-01', periods=14),
        'Sales': [10, 20, 15, 25, 30, 40, 35, 45, 50, 60, 55, 65, 70, 75]}

df = pd.DataFrame(data)

# Calculate and add the 'MovingAverage' column
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

print(df)

         Date  Sales  MovingAverage
0  2023-08-01     10      10.000000
1  2023-08-02     20      15.000000
2  2023-08-03     15      15.000000
3  2023-08-04     25      17.500000
4  2023-08-05     30      20.000000
5  2023-08-06     40      23.333333
6  2023-08-07     35      25.000000
7  2023-08-08     45      30.000000
8  2023-08-09     50      34.285714
9  2023-08-10     60      40.714286
10 2023-08-11     55      45.000000
11 2023-08-12     65      50.000000
12 2023-08-13     70      54.285714
13 2023-08-14     75      60.000000

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [61]:
#For example, if df contains the following values:

# Date
# 0 2023-01-01
# 1 2023-01-02
# 2 2023-01-03
# 3 2023-01-04
# 4 2023-01-05

#Your function should create the following DataFrame:

# Date Weekday
# 0 2023-01-01 Sunday
# 1 2023-01-02 Monday
# 2 2023-01-03 Tuesday
# 3 2023-01-04 Wednesday
# 4 2023-01-05 Thursday
# The function should return the modified DataFrame.

In [63]:
import pandas as pd

data={"Date":pd.date_range(start="01-01-2023",periods=10)}

In [65]:
pd.DataFrame(data)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07
7 2023-01-08
8 2023-01-09
9 2023-01-10

In [66]:
df=pd.DataFrame(data)

In [73]:
df['Weekday'] = df['Date'].dt.day_name()

In [74]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday
7 2023-01-08     Sunday
8 2023-01-09     Monday
9 2023-01-10    Tuesday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [76]:
import pandas as pd

# Example DataFrame
data = {'Date': pd.to_datetime(['2023-01-01', '2023-01-15', '2023-01-25', '2023-02-10', '2023-03-05']),
        'Value': [10, 20, 30, 40, 50]}

df = pd.DataFrame(data)

# Define start and end dates
start_date = '2023-01-01'
end_date = '2023-01-31'

# Select rows between specified dates
selected_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

print(selected_df)

        Date  Value
0 2023-01-01     10
1 2023-01-15     20
2 2023-01-25     30

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### Ans- To use the basic functions of pandas, you need to import the pandas library itself. The most common convention is to import it using the alias pd. Here's how you would typically import pandas:

In [77]:
import pandas as pd